app/views/developers/index.html.erb

SELECT "languages"."code" FROM "languages" INNER JOIN "developer_languages" ON "languages"."id" = "developer_languages"."language_id" WHERE "developer_languages"."developer_id" = $1  [["developer_id", 106]]
---
            <td>
              <%= developer.languages.pluck(:code).join(', ') %>,
            </td>