app/controllers/developers_controller.rb

  def index
    @skills = ProgrammingLanguage.all
    @languages = Language.all

    @skill_selected = nil
    @language_selected = nil

    @developers = params['email'].present? ? Developer.includes(:skills, :languages).quick_search(params['email']) : Developer.includes(:skills, :languages)

    if params['skill'].present?
      @skill_selected = ProgrammingLanguage.includes(:developers).find(params['skill'])
---
SELECT "languages".* FROM "languages"
SELECT "programming_languages".* FROM "programming_languages"
SELECT "languages".* FROM "languages" WHERE "languages"."id" IN (58, 57, 51, 66, 47, 61, 49, 67, 45, 71, 50, 75, 48, 70, 76, 72, 46, 69, 62, 55, 60, 65, 52, 63, 74, 42, 54, 41, 44, 59, 68, 73, 64, 56, 43, 53)
SELECT DISTINCT "developers".* FROM "developers" INNER JOIN (SELECT "developers"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("developers"."email"::text, ''))), (to_tsquery('simple', ''' ' || 'he' || ' ''' || ':*')), 0)) AS rank FROM "developers" WHERE (((to_tsvector('simple', coalesce("developers"."email"::text, ''))) @@ (to_tsquery('simple', ''' ' || 'he' || ' ''' || ':*'))))) AS pg_search_ee0b1e6ad69be79bbad963 ON "developers"."id" = pg_search_ee0b1e6ad69be79bbad963.pg_search_id ORDER BY pg_search_ee0b1e6ad69be79bbad963.rank DESC, "developers"."id" ASC
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
SELECT "developers".* FROM "developers" WHERE "developers"."id" = 105
SELECT "programming_languages".* FROM "programming_languages" WHERE "programming_languages"."id" IN (31, 21, 36, 26, 19, 18, 25, 27, 28, 33, 30, 20, 23, 35, 29, 22, 24, 34, 32)